README.org
#+TITLE: briss2
#+OPTIONS: toc:nil

/PDF Cropper and Rearranger/

  * Home page :: [[http://danmbox.github.com/briss2]]
  * Downloads :: [[https://github.com/danmbox/briss2][github]]
  * Author :: Gerhard Aigner; [[http://alumnus.caltech.edu/~muresan/][Dan A. Muresan]] (danmbox at gmail dot com)

* DESCRIPTION

  [[http://danmbox.github.com/briss2][briss2]] (a fork of the
  [[http://briss.sourceforge.net/][original Briss]] project) can
  convert two-column layouts to single-column, trim excessive margins
  divide portrait documents into multiple landscape strips and more.

* DEPENDENCIES

  * Java
  * maven
  * itext, jpedal and Java Advanced Imaging API (pulled by maven during build)

* INSTALLING

Download with =git=; there is no installation script.

=git clone git://github.com/danmbox/briss2.git=

Build with:

=mvn package assembly:single=

then unpack the zip from target/ to the installation directory since
it has the dependencies in it (you can't just use the .jar generated in
the root directory without them!

=tar -xf briss2-*.tar.bz2=

or

=unzip briss2-*.zip=

and possibly move it somewhere.

=mv briss2-1.0.1-rc.1 ~/bin/briss2=

* RUNNING

=java -jar /path/to/briss-*.jar --help=

* COPYRIGHT

  * Copyright 2010 Gerhard Aigner; Copyright 2014 Dan A. Muresan
  * License: GPL v3.0
