README.html
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>briss2</title>
<!-- 2014-07-27 Sun 21:16 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Dan">
</head>
<body>
<div id="content">
<h1 class="title">briss2</h1>
<p>
<i>PDF Cropper and Rearranger</i>
</p>

<dl class="org-dl">
<dt> Home page </dt><dd><a href="http://danmbox.github.com/briss2">http://danmbox.github.com/briss2</a>
</dd>
<dt> Downloads </dt><dd><a href="https://github.com/danmbox/briss2">github</a>
</dd>
<dt> Author </dt><dd>Gerhard Aigner; <a href="http://alumnus.caltech.edu/~muresan/">Dan A. Muresan</a> (danmbox at gmail dot com)
</dd>
</dl>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> DESCRIPTION</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="http://danmbox.github.com/briss2">briss2</a> (a fork of the
<a href="http://briss.sourceforge.net/">original Briss</a> project) can
convert two-column layouts to single-column, trim excessive margins
divide portrait documents into multiple landscape strips and more.</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> DEPENDENCIES</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Java
</li>
<li>maven
</li>
<li>itext, jpedal and Java Advanced Imaging API (pulled by maven during build)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> INSTALLING</h2>
<div class="outline-text-2" id="text-3">
<p>
Download with <code>git</code>; there is no installation script.
</p>

<p>
<code>git clone git://github.com/danmbox/briss2.git</code>
</p>

<p>
Build with:
</p>

<p>
<code>mvn package assembly:single</code>
</p>

<p>
then unpack the zip from target/ to the installation directory since
it has the dependencies in it (you can't just use the .jar generated in
the root directory without them!
<p>
<code>tar -xf briss2-*.tar.bz2</code>
</p>
or
<p>
<code>unzip briss2-*.zip</code>
</p>

and possibly move it somewhere.
<p>
<code>mv briss2-1.0.1-rc.1 ~/bin/briss2</code>
</p>

</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> RUNNING</h2>
<div class="outline-text-2" id="text-4">
<p>
<code>java -jar /path/to/briss-*.jar --help</code>
</p>

</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> COPYRIGHT</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Copyright 2010 Gerhard Aigner; Copyright 2014 Dan A. Muresan
</li>
<li>License: GPL v3.0
</li>
</ul>
</div>
</div>
</div>
</body>
</html>
